xmls/samples.xml

<?xml version="1.0" encoding="utf-8"?>
<Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<Body>
		<ConsultaNFeRequest xmlns="http://www.prefeitura.sp.gov.br/nfe">
			<VersaoSchema>
				1
			</VersaoSchema>
			<MensagemXML>
				<PedidoConsultaCNPJ>
					<Cabecalho Versao="1">
						<CPFCNPJRemetente>
							36114236882
						</CPFCNPJRemetente>
						<Versao>
							1
						</Versao>
						<CNPJRemetente>
							62391818000130
						</CNPJRemetente>
					</Cabecalho>
				</PedidoConsultaCNPJ>
			</MensagemXML>
		</ConsultaNFeRequest>
	</Body>
</Envelope>
